## Plans :thumbsup:

Outputs can be viewed in the Terrateam Console [here](http://mule-casual-actively.ngrok-free.app/i/55143082/runs/adef6c7c-3fab-4af5-8e2a-c7ae03e4b777).

## Terrateam Plan Output :thumbsup:
<details>
  <summary>Expand for plan output details</summary>


## Dir: tf | Success :thumbsup:
**Dir**: tf
**Workspace**: default
**Success**: :thumbsup:

**Step**: plan
**Success**: :thumbsup:
**Command**: `terraform plan -detailed-exitcode -out /tmp/tmpu8mzhlkx/plan`
```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # ansible_playbook.playbook will be created
+   resource "ansible_playbook" "playbook" {
+       ansible_playbook_binary = "ansible-playbook"
+       ansible_playbook_stderr = (known after apply)
+       ansible_playbook_stdout = (known after apply)
+       args                    = (known after apply)
+       check_mode              = false
+       diff_mode               = false
+       extra_vars              = {
+           "var_a" = "Some variable"
+           "var_b" = "Another variable"
        }
+       force_handlers          = false
+       id                      = (known after apply)
+       ignore_playbook_failure = false
+       name                    = "host-1.example.com"
+       playbook                = "playbook.yml"
+       replayable              = true
+       temp_inventory_file     = (known after apply)
+       verbosity               = 0
    }

Plan: 1 to add, 0 to change, 0 to destroy.

```

</details>

## Cost Estimation
**Total Monthly Difference: 0.00 USD**
<details>
  <summary>Expand for cost estimation details</summary>

| Dir | Workspace | Previous (USD) | New (USD) | Diff (USD) |
| :---: | :---: | ---: | ---: | ---: |
| tf | default | 0.00 | 0.00 | 0.00|
| | **Total** | **0.00** | **0.00** | **0.00** |
</details>

---

To apply all these changes, comment:

```
terrateam apply
```

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
